c_company/app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "asbraich_20@tamu.edu"], ["LIMIT", 1]]
INSERT INTO "users" ("first_name", "last_name", "role", "email", "platoon_id", "created_at", "updated_at", "class_year", "military_affiliation", "military_branch") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    user_info = request.env['omniauth.auth']
    user = User.find_by(email: user_info.info.email)
    if user.nil?
      user = User.create!(
        first_name: user_info.info.first_name,
        last_name: user_info.info.last_name,
        email: user_info.info.email,
        role: 'pleb'
      )